app/Controllers/DashboardController.php

    public function index()
    {
        // Get current user info from session
        $session = session();
        $userRole = $session->get('role') ?? 'HRD';
        $userName = $session->get('name') ?? 'User';
        $userId = $session->get('user_id') ?? 1;

        // Get statistics
        $folderModel = new FolderModel();
        $documentModel = new HrdDocumentModel();
        $notificationModel = new NotificationModel();
        $userModel = new UserModel();

        // Get folder statistics
        $totalFolders = $folderModel->countAll();
        $userFolders = $folderModel->where('owner_id', $userId)->countAllResults();

        // Get document statistics
        $totalDocuments = $documentModel->countAll();
        $totalFiles = $documentModel->countAll(); // Same as totalDocuments for now
        $totalHrdFiles = $documentModel->countAll(); // Same as totalDocuments for now

        // Get user statistics
        $totalUser = $userModel->countAll();

        // Get recent documents (limit 5)
        $recentDocuments = $documentModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

        // Get unread notifications for current user
        $unreadNotifications = $notificationModel->where('user_id', $userId)
                                                ->where('is_read', 0)
                                                ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `folders`
SELECT COUNT(*) AS `numrows`
FROM `folders`
WHERE `owner_id` = '9'
SELECT COUNT(*) AS `numrows` FROM `hrd_documents`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `hrd_documents`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '9'
AND `is_read` = 0