app/Controllers/DokumenControllerStaff.php

    public function createFolder()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(405)->setJSON(['status' => 'error', 'message' => 'Metode tidak diizinkan.']);
        }

        $userId = $this->session->get('user_id');
        if (!$userId) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized. User not logged in.']);
        }

        $input = $this->request->getJSON(true);

        $folderName = $input['name'] ?? null;
        $parentId = $input['parent_id'] ?? null;
        // Ambil folder_type, is_shared, shared_type, access_roles dari parent jika ada
        // atau gunakan default jika di root.
        // PENTING: Jangan ambil langsung dari input client jika parent_id ada,
        // karena parent_id akan menentukan tipe folder.
        $folderType = 'personal';
        $isShared = 0;
        $sharedType = null;
        $accessRoles = null;

        if ($parentId) {
            $parentFolder = $this->folderModel->find($parentId);
---
SELECT *
FROM `folders`
WHERE `folders`.`id` = 78

        ];

        // --- Mulai proses insert dan pembuatan folder fisik ---
        if ($this->folderModel->insert($data)) {
---
INSERT INTO `folders` (`name`, `parent_id`, `owner_id`, `folder_type`, `is_shared`, `shared_type`, `access_roles`, `created_at`, `updated_at`) VALUES ('ddsknjsdbhbsdhbabd', 78, '3', 'shared', 1, 'read', '[\"Staff\",\"Manager\",\"Supervisor\",\"Direksi\"]', '2025-07-31 10:43:00', '2025-07-31 10:43:00')

    public function dokumenBersama()
    {
        $session = session();
        $userId = $session->get('user_id');
        $roleId = $session->get('role_id');

        if (!$userId) {
            log_message('warning', 'DokumenControllerStaff::dokumenBersama(): User ID tidak ditemukan di sesi. Redirecting ke login.');
            return redirect()->to(base_url('login'));
        }

        $userRoleData = $this->roleModel->find($roleId);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'