app/Controllers/DokumenControllerStaff.php



        // Query untuk file yatim (orphan files) milik Staff yang sedang login (tidak ada di folder manapun)
        $orphanFiles = $this->fileModel->where('uploader_id', $userId)
            ->where('folder_id', NULL)
            ->findAll();
---
SELECT *
FROM `files`
WHERE `uploader_id` = '6'
AND `folder_id` IS NULL

    public function viewFolder($folderId = null)
    {
        // --- DEBUG: Mulai fungsi viewFolder ---
        log_message('debug', 'DokumenControllerStaff::viewFolder: Fungsi dimulai untuk Folder ID: ' . ($folderId ?? 'NULL'));

        if ($folderId === null) {
            log_message('error', 'DokumenControllerStaff::viewFolder: Folder ID tidak ditentukan.');
            throw PageNotFoundException::forPageNotFound('Folder ID tidak ditentukan.');
        }

        $userId = $this->session->get('user_id'); // Menggunakan $this->session
        log_message('debug', 'DokumenControllerStaff::viewFolder: User ID dari sesi: ' . ($userId ?? 'NULL'));

        if (!$userId) {
            log_message('warning', 'DokumenControllerStaff::viewFolder: Pengguna tidak login, redirect ke halaman login.');
            return redirect()->to(base_url('login'))->with('error', 'Anda harus login untuk mengakses folder.');
        }

        $currentFolder = $this->folderModel->find($folderId);
---
SELECT *
FROM `folders`
WHERE `folders`.`id` = '1'

    public function createFolder()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(405)->setJSON(['status' => 'error', 'message' => 'Metode tidak diizinkan.']);
        }

        $json = $this->request->getJSON();
        if (empty($json)) {
            return $this->failValidationErrors(['data' => 'Tidak ada data JSON yang diterima.']);
        }

        $userId = $this->session->get('user_id');
        if (!$userId) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized. User not logged in.']);
        }

        $input = $this->request->getJSON(true);

        $folderName = $input['name'] ?? null;
        $parentId = $input['parent_id'] ?? null;
        // Ambil folder_type, is_shared, shared_type, access_roles dari parent jika ada
        // atau gunakan default jika di root.
        // PENTING: Jangan ambil langsung dari input client jika parent_id ada,
        // karena parent_id akan menentukan tipe folder.
        $folderType = 'personal';
        $isShared = 0;
        $sharedType = null;
        $accessRoles = null;

        if ($parentId) {
            $parentFolder = $this->folderModel->find($parentId);
---
SELECT *
FROM `folders`
WHERE `folders`.`id` = 187


        // --- Mulai proses insert dan pembuatan folder fisik ---
        if ($this->folderModel->insert($data)) {
            $newFolderId = $this->folderModel->insertID();
---
INSERT INTO `folders` (`name`, `parent_id`, `owner_id`, `folder_type`, `is_shared`, `shared_type`, `access_roles`, `created_at`, `updated_at`) VALUES ('hih huh hahahaha', 187, '8', 'shared', 1, 'full', '[\"Staff\",\"Supervisor\",\"Manager\",\"Direksi\"]', '2025-08-06 14:10:09', '2025-08-06 14:10:09')

    public function dokumenBersama()
    {
        $session = session();
        $userId = $session->get('user_id');
        $roleId = $session->get('role_id');

        if (!$userId) {
            log_message('warning', 'DokumenControllerStaff::dokumenBersama(): User ID tidak ditemukan di sesi. Redirecting ke login.');
            return redirect()->to(base_url('login'));
        }

        $userRoleData = $this->roleModel->find($roleId);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '2'