app/Controllers/DokumenControllerHRD.php

    public function dokumenUmumFolder($folderId)
    {
        $hrdDocumentModel = new \App\Models\HrdDocumentModel();

        // Validasi folder exists
        $folder = $hrdDocumentModel->find($folderId);
---
SELECT *
FROM `hrd_documents`
WHERE `hrd_documents`.`id` = '18'

    public function uploadFileUmum()
    {
        // Clear any previous output
        if (ob_get_level()) {
            ob_clean();
        }

        // Set proper headers
        $this->response->setHeader('Content-Type', 'application/json');
        $this->response->setHeader('Cache-Control', 'no-cache, must-revalidate');

        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(405)->setJSON(['status' => 'error', 'message' => 'Metode tidak diizinkan.']);
        }

        $file = $this->request->getFile('file');
        $parentId = $this->request->getPost('parent_id');
        $description = $this->request->getPost('description');

        if (!$file || !$file->isValid()) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'File tidak valid.']);
        }

        // Validasi parent folder
        $hrdDocumentModel = new \App\Models\HrdDocumentModel();
        if ($parentId) {
            $parentFolder = $hrdDocumentModel->find($parentId);
---
SELECT *
FROM `hrd_documents`
WHERE `hrd_documents`.`id` = '5'