app/Controllers/DokumenControllerSPV.php

    public function dokumenStaffUntukSPV()
    {
        $userId = $this->session->get('user_id');
        $roleId = $this->session->get('role_id');

        // Pastikan login dan role adalah Supervisor (role_id 5)
        if (!$userId || $roleId != 5) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Anda tidak memiliki izin untuk mengakses halaman ini.');
        }

        // Ambil SEMUA user dengan role Staff (asumsi role_id 4)
        $staffUsers = $this->userModel->where('role_id', 6)->findAll();
        $staffUserIds = array_column($staffUsers, 'id'); // Ambil array ID staff

        $data = [
            'title' => 'Dokumen Seluruh Staff',
            'personalFolders' => [], // Untuk folder level atas dari staff
            'orphanFiles' => [], // Untuk file tanpa folder dari staff
        ];

        if (!empty($staffUserIds)) {
            // Mengambil folder personal level paling atas (parent_id NULL) dari semua staff
            $data['personalFolders'] = $this->folderModel
                ->select('folders.*, users.name as owner_name, users.email as owner_email')
                ->join('users', 'users.id = folders.owner_id', 'left')
                ->whereIn('folders.owner_id', $staffUserIds)
                ->where('folders.parent_id', NULL) // Hanya ambil folder root
                ->where('folders.folder_type', 'personal') // Pastikan hanya folder personal
                ->orderBy('users.name', 'ASC')
                ->orderBy('folders.name', 'ASC')
                ->findAll();

            // Mengambil file tanpa folder (orphan files) dari semua staff
            $data['orphanFiles'] = $this->fileModel
                ->select('files.*, users.name as uploader_name, users.email as uploader_email')
                ->join('users', 'users.id = files.uploader_id', 'left')
                ->whereIn('files.uploader_id', $staffUserIds)
                ->where('files.folder_id', NULL) // File yang tidak terasosiasi dengan folder
                ->orderBy('users.name', 'ASC')
                ->orderBy('files.file_name', 'ASC')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `role_id` = 6
SELECT `folders`.*, `users`.`name` as `owner_name`, `users`.`email` as `owner_email`
FROM `folders`
LEFT JOIN `users` ON `users`.`id` = `folders`.`owner_id`
WHERE `folders`.`owner_id` IN ('6','10')
AND `folders`.`parent_id` IS NULL
AND `folders`.`folder_type` = 'personal'
ORDER BY `users`.`name` ASC, `folders`.`name` ASC
SELECT `files`.*, `users`.`name` as `uploader_name`, `users`.`email` as `uploader_email`
FROM `files`
LEFT JOIN `users` ON `users`.`id` = `files`.`uploader_id`
WHERE `files`.`uploader_id` IN ('6','10')
AND `files`.`folder_id` IS NULL
ORDER BY `users`.`name` ASC, `files`.`file_name` ASC

                    'updated_at' => date('Y-m-d H:i:s'),
                ];

                if ($this->fileModel->insert($data)) {
---
INSERT INTO `files` (`folder_id`, `uploader_id`, `file_name`, `file_path`, `file_size`, `file_type`, `created_at`, `updated_at`) VALUES (15, '8', 'Cloud.sql', '1754540566_3ee908dae39a3a48a207.csv', 22952, 'text/plain', '2025-08-07 11:22:46', '2025-08-07 11:22:46')