app/Controllers/Login.php

    public function proses()
    {
        log_message('info', 'Login proses method called');

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        log_message('info', 'Email: ' . $email);
        log_message('info', 'Password length: ' . strlen($password));

        if (empty($email) || empty($password)) {
            log_message('info', 'Empty email or password');
            return redirect()->back()->with('error', 'Email dan password harus diisi');
        }
        $db = \Config\Database::connect();
        $user = $db->table('users')
                    ->where('email', $email)
                    ->where('is_active', 1)
                    ->get()
                    ->getRowArray();
        log_message('info', 'User found: ' . ($user ? 'YES' : 'NO'));
        if ($user) {
            log_message('info', 'User role_id: ' . $user['role_id']);
        }

        if ($user && password_verify($password, $user['password_hash'])) {
            log_message('info', 'Password verified successfully');

            $roleName = $db->table('roles')
                ->where('id', $user['role_id'])
                ->get()
                ->getRow('name');
---
SELECT *
FROM `users`
WHERE `email` = 'eko.spv@uss.com'
AND `is_active` = 1
SELECT *
FROM `roles`
WHERE `id` = '5'