app/Controllers/Staff.php

     public function viewSharedFolder(int $folderId = null)
    {
        helper(['form', 'url']);

        $userId = session()->get('user_id');
        if (!$userId) {
            log_message('error', 'User not authenticated when trying to access shared folder ' . $folderId);
            return redirect()->to(base_url('auth/login')); // Redirect ke login jika tidak terautentikasi
        }

        $user = $this->userModel
            ->select('users.id, users.name, roles.name as role_name')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->find($userId);
---
SELECT `users`.`id`, `users`.`name`, `roles`.`name` as `role_name`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '8'

            $currentParentId = $currentFolder['id'];
            // Loop ke atas melalui parent untuk menemukan folder shared terdekat
            while ($currentParentId !== null) {
                $ancestorFolder = $this->folderModel->find($currentParentId);
---
SELECT *
FROM `folders`
WHERE `folders`.`id` = '187'