app/Controllers/Staff.php

SELECT `users`.`id`, `users`.`name`, `roles`.`name` as `role_name`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '3'
---
     public function viewSharedFolder(int $folderId = null)
{
    helper(['form', 'url']);

    $userId = session()->get('user_id');
    if (!$userId) {
        log_message('error', 'User not authenticated when trying to access shared folder ' . $folderId);
        throw new Exception('Anda tidak terautentikasi. Silakan login kembali.');
    }

    $user = $this->userModel
        ->select('users.id, users.name, roles.name as role_name')
        ->join('roles', 'roles.id = users.role_id', 'left')
        ->find($userId);