app/Models/ActivityLogsModel.php

    public function logActivity($userId, $action, $targetType, $targetId, $targetName = null, $details = null)
    {
        $data = [
            'user_id'     => $userId,
            'action'      => $action,
            'target_type' => $targetType,
            'target_id'   => $targetId,
            'target_name' => $targetName, // Simpan nama di sini
            'details'     => json_encode($details),
            'timestamp'   => date('Y-m-d H:i:s')
        ];

        return $this->insert($data);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `target_type`, `target_id`, `target_name`, `details`, `timestamp`) VALUES ('8', 'create_folder', 'folder', 188, 'hih huh hahahaha', 'null', '2025-08-06 14:10:09')