app/Models/FileModel.php

SELECT *
FROM `files`
WHERE `folder_id` = 187
ORDER BY `file_name` ASC
---
    public function getFilesByFolder(int $folderId): array
    {
        return $this->where('folder_id', $folderId)
            ->orderBy('file_name', 'ASC') // Mengurutkan berdasarkan nama file
            ->findAll();

SELECT `files`.*, `users`.`name` as `uploader_name`, `roles`.`name` as `uploader_role`
FROM `files`
LEFT JOIN `users` ON `users`.`id` = `files`.`uploader_id`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `files`.`folder_id` = 401
ORDER BY `files`.`file_name` ASC
---
    public function getFilesByFolderWithUploader(int $folderId): array
    {
        return $this->select('files.*, users.name as uploader_name, roles.name as uploader_role')
            ->join('users', 'users.id = files.uploader_id', 'left')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->where('files.folder_id', $folderId)
            ->orderBy('files.file_name', 'ASC')
            ->findAll();

SELECT *
FROM `files`
WHERE `folder_id` IS NULL
AND `uploader_id` IN ('4')
ORDER BY `file_name` ASC
---
    public function getSupervisorFiles(?int $folderId, int $currentUserId): array
    {
        // Mengambil ID dari semua pengguna dengan peran 'Supervisor' (role_id 3)
        $userModel = new UserModel();

        // Asumsi: Ada metode getUsersByRole() di UserModel
        // Ganti 'Supervisor' dengan nama peran yang benar di database Anda
        $supervisorUserIds = $userModel->getUsersByRole('Supervisor');

        $builder = $this->builder();

        // Memfilter file berdasarkan folder_id
        if ($folderId === null) {
            $builder->where('folder_id IS NULL');
        } else {
            $builder->where('folder_id', $folderId);
        }

        $builder->whereIn('uploader_id', $supervisorUserIds);

        $builder->orderBy('file_name', 'ASC');

        return $builder->get()->getResultArray();

SELECT *
FROM `files`
WHERE `folder_id` IS NULL
AND `uploader_id` IN ('4')
ORDER BY `file_name` ASC
---
    public function getManagerFiles(?int $folderId, int $currentUserId): array
    {
        // Mengambil ID dari semua pengguna dengan peran 'Manager'
        $userModel = new UserModel();

        $managerUserIds = $userModel->getUsersByRole('Manajer');

        $builder = $this->builder();

        // Memfilter file berdasarkan folder_id
        if ($folderId === null) {
            $builder->where('folder_id IS NULL');
        } else {
            $builder->where('folder_id', $folderId);
        }

        // PERBAIKAN: Tambahkan pengecekan apakah ada user ID yang ditemukan
        if (!empty($managerUserIds)) {
            $builder->whereIn('uploader_id', $managerUserIds);
        } else {
            // Jika tidak ada user manager, kembalikan array kosong agar tidak terjadi error SQL
            return [];
        }

        $builder->orderBy('file_name', 'ASC');

        return $builder->get()->getResultArray();