app/Models/FolderModel.php

SELECT *
FROM `folders`
WHERE `name` = 'Database File'
AND `parent_id` IS NULL
AND `owner_id` = 8
 LIMIT 1
---
    public function findOrCreateByPath(string $path, ?int $rootParentId, int $userId): ?int
    {
        if (empty($path)) {
            return $rootParentId;
        }

        $pathParts = explode('/', trim($path, '/'));
        $currentParentId = $rootParentId;

        foreach ($pathParts as $part) {
            $folder = $this->where('name', $part)
                ->where('parent_id', $currentParentId)
                ->where('owner_id', $userId)
                ->first();

SELECT *
FROM `folders`
WHERE `folders`.`id` = 78
---
    public function isNameExists(string $name, ?int $parentId, int $ownerId, ?int $excludeId = null): bool
    {
        $builder = $this->builder();
        $builder->where('name', $name);
        $builder->where('owner_id', $ownerId);

        if ($parentId === null || $parentId === 0) {
            $builder->where('parent_id IS NULL');
        } else {
            $builder->where('parent_id', $parentId);
        }

        if ($excludeId !== null) {
            $builder->where('id !=', $excludeId);
        }

        return $builder->countAllResults() > 0;

SELECT *
FROM `folders`
WHERE `folders`.`id` = 401
---
    public function getBreadcrumbs(int $folderId): array
    {
        $path = [];
        $currentId = $folderId;

        while ($currentId !== null && $currentId !== 0) {
            $folder = $this->find($currentId);

SELECT `folders`.*, `users`.`name` as `owner_name`, `roles`.`name` as `owner_role`
FROM `folders`
JOIN `users` ON `users`.`id` = `folders`.`owner_id`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `folders`.`id` = 187
 LIMIT 1
---
    public function getFolderWithOwner(int $folderId): ?array
    {
        // Pastikan Anda memilih owner_name dan owner_role di sini
        return $this->select('folders.*, users.name as owner_name, roles.name as owner_role')
            ->join('users', 'users.id = folders.owner_id')
            ->join('roles', 'roles.id = users.role_id', 'left') // Bergabung dengan tabel roles
            ->where('folders.id', $folderId)
            ->first();

SELECT *
FROM `folders`
WHERE `parent_id` = 187
AND   (
`owner_id` = 8
OR `shared_type` = 'public'
OR    (
`is_shared` = 1
AND `access_roles` IS NOT NULL
AND JSON_CONTAINS(access_roles, '"HRD"')
  )
 )
ORDER BY `name` ASC
---
    public function getSubfolders(int $parentId, int $currentUserId, string $currentUserRole): array
    {
        $builder = $this->builder();

        $builder->where('parent_id', $parentId);

        // --- Perbaikan logika otorisasi ---
        $builder->groupStart(); // Mulai grup untuk semua kondisi OR

        // Kondisi 1: Folder adalah milik user yang login
        $builder->where('owner_id', $currentUserId);

        // Kondisi 2: Folder adalah 'public' (dibagikan ke semua orang)
        $builder->orWhere('shared_type', 'public');

        // Kondisi 3: Folder dibagikan ke peran tertentu (is_shared = 1 dan role ada di access_roles)
        $builder->orGroupStart(); // Mulai grup OR bersarang untuk kondisi shared + role
        $builder->where('is_shared', 1);
        $builder->where('access_roles IS NOT NULL');
        // Menggunakan JSON_CONTAINS untuk pencarian role yang lebih akurat
        $builder->where(new RawSql("JSON_CONTAINS(access_roles, '\"{$currentUserRole}\"')"));
        $builder->groupEnd(); // Akhiri grup OR bersarang

        $builder->groupEnd(); // Akhiri grup untuk semua kondisi OR

        $builder->orderBy('name', 'ASC');

        return $builder->get()->getResultArray();

SELECT *
FROM `folders`
WHERE `owner_id` = 8
AND `folder_type` = 'personal'
AND `is_shared` = 0
AND `parent_id` IS NULL
ORDER BY `name` ASC
---
    public function getMyPersonalFolders(int $ownerId, ?int $parentId = null): array
    {
        $builder = $this->builder();
        $builder->where('owner_id', $ownerId)
            ->where('folder_type', 'personal')
            ->where('is_shared', 0);

        if ($parentId === null || $parentId === 0) {
            $builder->where('parent_id IS NULL');
        } else {
            $builder->where('parent_id', $parentId);
        }

        $builder->orderBy('name', 'ASC');

        return $builder->get()->getResultArray();

SELECT `folders`.*, `users`.`name` as `owner_name`, `roles`.`name` as `owner_role_name`
FROM `folders`
LEFT JOIN `users` ON `users`.`id` = `folders`.`owner_id`
LEFT JOIN `roles` ON `roles`.`id` = `folders`.`owner_role`
WHERE `folders`.`parent_id` = 401
AND   (
`folders`.`owner_id` = 5
OR `folders`.`owner_role` = 5
OR    (
`folders`.`is_shared` = 1
AND `folders`.`access_roles` IS NOT NULL
AND JSON_CONTAINS(folders.access_roles, '"5"')
  )
OR `folders`.`folder_type` = 'public'
 )
ORDER BY `folders`.`name` ASC
---
    public function getSubfoldersWithDetails(int $parentId, int $currentUserId = null, int $currentUserRoleId = null): array
    {
        $builder = $this->select('folders.*, users.name as owner_name, roles.name as owner_role_name')
            ->join('users', 'users.id = folders.owner_id', 'left')
            ->join('roles', 'roles.id = folders.owner_role', 'left'); // Bergabung dengan tabel roles menggunakan owner_role di tabel folders

        $builder->where('folders.parent_id', $parentId);
        $builder->groupStart();
        $builder->where('folders.owner_id', $currentUserId);
        $builder->orWhere('folders.owner_role', $currentUserRoleId);
        if ($currentUserRoleId !== null) {
            $builder->orGroupStart()
                ->where('folders.is_shared', 1)
                ->where('folders.access_roles IS NOT NULL')
                ->where(new RawSql("JSON_CONTAINS(folders.access_roles, '\"{$currentUserRoleId}\"')")) // Menggunakan role ID
                ->groupEnd();
        }
        $builder->orWhere('folders.folder_type', 'public');

        $builder->groupEnd();

        $builder->orderBy('folders.name', 'ASC');

        return $builder->findAll();