app/Models/HrdDocumentModel.php

    public function getByParent($parentId = null)
    {
        return $this->where('parent_id', $parentId)
                    ->orderBy('type', 'ASC') // Folder dulu
                    ->orderBy('name', 'ASC')
                    ->findAll();
---
SELECT *
FROM `hrd_documents`
WHERE `parent_id` IS NULL
ORDER BY `type` ASC, `name` ASC