app/Models/UserModel.php

SELECT *
FROM `roles`
WHERE `name` = 'Manajer'
 LIMIT 1
SELECT `id`
FROM `users`
WHERE `role_id` = '4'
---
    public function getUsersByRole(string $roleName): array
    {
        $roleModel = new RoleModel();
        // PERBAIKAN: Mengganti 'role_name' dengan 'name' dan 'Manager' dengan 'Manajer'
        $role = $roleModel->where('name', 'Manajer')->first();

        if ($role === null) {
            return [];
        }

        $userIds = $this->select('id')->where('role_id', $role['id'])->findAll();